[M_MightyMorphin MissionDefinition]
TurnInDescription="You helped Sir Hammerlock realize that nature isn't always beautiful. Which would have been kind of poignant, had his immediate reaction not been ''oh god kill all of them ew ew ew ew.''"

[M_MightyMorphin:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Sir Hammerlock wanted you to find some varkids in [place]Tundra Express[-place], force them to morph, and then inject their cocoons with a special serum so he could study their morphing capabilities. Upon seeing the horrific way the varkids actually morph, however, Hammerlock found himself disgusted at the process and asked you to kill as many of the morphing buggers as possible. He'd also like you to bring him some samples of the mutated varkid corpses."
